{"config": [{"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "trainable": true, "batch_input_shape": [null, 784], "kernel_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 32, "name": "dense_2", "kernel_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 32, "name": "dense_3", "kernel_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "activation": "softmax", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 10, "name": "dense_4", "kernel_constraint": null}}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8"}